
// Складіть програму, яка приймає з клавіатури два цілі числа 
// і виводить на екран наступні значення
// (кожне в окремому рядку): квадрат кожного числа 
// (окремо) та суму квадратів введених чисел.

let num = prompt('Дай ціле число');
num = Number(num);
let num2 = prompt('Дай ціле число');
num = Number(num);
if(isNaN(num )){
	console.log('ти тупе, ЦИФРИ треба писати, довбень');
} else{
	console.log(Math.pow(num, 2)); 
	
	// Math.pow(num, 2) - за допомогою цієї команди можна числа робити в 
	// квадраті чи в кубі ота "2" це квадрат а "num" це число яке треба поставити
	// в квадраті.
	// Якщо хочеш ввиести сумму цих квадратів, то потрібно лишень додати)))
	
	console.log(Math.pow(num2, 2));
	console.log(Math.pow(num, 2) + Math.pow(num2, 2));
}