// Складіть програму, яка приймає з клавіатури два цілі числа,
// перше з яких - рік народження учня,
// а друге - нинішній (поточний) рік.
// Програма має вивести вік віку учня (у цілих роках).

let num = prompt('Рік народження');
num = Number(num);
let num2 = prompt('Поточний рік');
num = Number(num);
if(isNaN(num )){
	console.log('ти тупе, ЦИФРИ треба писати, довбень');
} else{
	console.log(num2 - num);
}
// я просто додаю рік народження і поточний рік і віднімаю від поточного, рік
// народження і виходить твій вік
